ms-python.python
njpwerner.autodocstring
charliermarsh.ruff
johnpapa.vscode-peacock
ms-vscode.hexeditor
ms-vscode-remote.vscode-remote-extensionpack
openai.chatgpt
ms-vscode-remote.remote-containers
ms-azuretools.vscode-containers
mechatroner.rainbow-csv
esbenp.prettier-vscode
